In [1]:
import pandas as pd

In [27]:
data = input()
grid = pd.read_csv(data, sep='\t', header=None)

GSM2188871_S2_rep2.ghits.pkbin.net.txt

In [30]:
grid.shape

(112768, 9)

In [28]:
grid.columns = ['chr_RNA','start_RNA','end_RNA','gene_ID','unk', 'strand','chr_DNA','genomic_POS','val']

In [29]:
grid.head()

,chr_RNA,start_RNA,end_RNA,gene_ID,unk,strand,chr_DNA,genomic_POS,val
0,chr2L,9839,21376,FBgn0002121,3670,-,chr2L,0,9.54898
1,chr2L,9839,21376,FBgn0002121,3670,-,chr2L,1000,16.13130
2,chr2L,9839,21376,FBgn0002121,3670,-,chr2L,2000,23.53030
3,chr2L,9839,21376,FBgn0002121,3670,-,chr2L,3000,32.33130
4,chr2L,9839,21376,FBgn0002121,3670,-,chr2L,4000,43.52430

In [31]:
33298573 in grid['start_RNA']

False

In [32]:
33303358 in grid['end_RNA']

False

In [94]:
A = pd.DataFrame(grid['start_RNA'])
B = pd.DataFrame(grid['end_RNA'])

M_full = pd.concat([A,B], sort=False, ignore_index=True, axis=1)

In [87]:
M_full.sample(5)

               0         1
107386  11473089  11474465
25316    6369712   6430794
94394    3401278   3465682
67228    5363876   5377528
63212    1095838   1176165

In [88]:
#m_sub = M.iloc[0:100, ]

In [89]:
#m_sub

       0      1
0   9839  21376
1   9839  21376
2   9839  21376
3   9839  21376
4   9839  21376
..   ...    ...
95  9839  21376
96  9839  21376
97  9839  21376
98  9839  21376
99  9839  21376

[100 rows x 2 columns]

In [90]:
for i,j in M_full.values:
    ranger = list(range(i,j+1))
    if 33298573 in ranger:
        M_full['lnc'] = 'ecCEBPA'
    else:
        M_full['lnc'] = None

/home/josoga2/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [95]:
M_full.sample(10)

M_full.to_csv(M_full.csv, header=None)

      0      1
0  9839  21376
1  9839  21376
2  9839  21376
3  9839  21376
4  9839  21376
5  9839  21376
6  9839  21376
7  9839  21376
8  9839  21376
9  9839  21376